# SystemsAnalysisOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SystemsAnalysisOptions Properties
SystemsAnalysisOptions Class See Also
---
The SystemsAnalysisOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OutputFolder | The path of the output folder for systems analysis. |
| WeatherFile | The file name of the EnergyPlus weather (*.epw). |
| WorkflowFile | The file name of the EnergyPlus workflow script. |

# See Also
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace